# AlreadyHaveTwoClosurePlanes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RefPlaneFailures..::..AlreadyHaveTwoClosurePlanes Property
BuiltInFailures..::..RefPlaneFailures Class See Also
---
No more than two closure planes are allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AlreadyHaveTwoClosurePlanes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlreadyHaveTwoClosurePlanes As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AlreadyHaveTwoClosurePlanes {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RefPlaneFailures Class
Autodesk.Revit.DB Namespace